import 'package:buhoor/core/constants.dart';

final poems = {
  {
    'poet': 'أبو العلاء المعري',
    'title': 'إليك تناهى كل فخر وسؤدد',
    'content': '''
    إليكَ تَنَاهى كلُّ فَخْرٍ وسُؤدَدٍ

    فأبْلِ اللّيالي والأنامَ وجَدِّدِ

    لجَدّكَ كان المَجْدُ ثمّ حَوَيْتُه

    ولابْنِكَ يُبْنَى منه أشرَفُ مَقْعدِ

    ثلاثةُ أيّامٍ هيَ الدّهرُ كلّه

    وما هُنّ غيرَ الأمسِ واليومِ والغَدِ

    وما البَدرُ إلاّ واحِدٌ غيرَ أنّه

    يَغِيبُ ويأتي بالضّياءِ المُجَدِّدِ

    فلا تَحْسِبِ الأقْمارَ خَلْقاً كثيرةً

    فجُمْلتُها مِن نَيّرٍ مُتَرَدِّدِ

    وللحَسَنِ الحُسْنى وإن جاد غيرُه

    فذلكَ جُودٌ ليس بالمُتَعَمَّدِ

    له الجَوْهَرُ السّاري يُؤمِّمُ شخصَه

    يَجوبُ إليه مَحْتِداً بَعْدَ مَحْتِدِ

    ولو كتَموا أنسابَهُمْ لَعَزَتْهُمُو

    وُجُوهٌ وفِعلٌ شاهِدٌ كلَّ مَشهَدِ

    وقدْ يُجْتَدى فضْلُ الغَمامِ وإنّما

    من البحرِ فيما يزعمُ الناسُ يَجتدي

    ويَهْدي الدليلُ القوْمَ والليلُ مُظلِمٌ

    ولكنّه بالنّجمِ يَهْدي ويَهْتَدي

    فيا أحلمَ السّاداتِ من غيرِ ذِلّةٍ

    ويا أجْوَدَ الأجْوادِ من غيرِ مَوْعِدِ

    وَطِئْتَ صروفَ الدهرِ وطْأةَ ثائرٍ

    فأتْلَفْتَ منها نَفْسَ ما لم تُصَفِّدِ

    وعَلّمْتَهُ منكَ التّأنّي فانْثَنى

    إذا رامَ أمراً رامَه بتأيُّدِ

    وأثْقَلْتَه مِن أنْعُمٍ وعَوَارِفٍ

    فسَارَ بها سيرَ البَطِيءِ المُقيّدِ

    ودانتْ لكَ الأيامُ بالرّغمِ وانْضَوَتْ

    إليك الليالي فارْمِ مَن شئتَ تُقْصِدِ

    بسَبْعِ إماءٍ من زَعاوَةَ زُوّجَتْ

    من الرَومِ في نَعْماكَ سبْعةَ أعْبُدِ

    ولولاكَ لم تُسْلَمْ أفامِيّةُ الرّدى

    وقد أبصَرَتْ مِن مِثْلِها مصرَعَ الرّدي

    فأنْقَذْتَ منها مَعقِلاً هَضَبَاتُه

    تَلَفّعُ من نسْجِ السّحابِ وترْتَدي

    وحِيداً بثغْرِ المسْلِمينَ كأنّهُ

    بفِيهِ مُبَقَّى من نَواجِذِ أدْرَدِ

    بأخضَرَ مثلِ البحرِ ليس اخضرارُه

    من الماء لكنْ من حديدٍ مُسَرَّدِ

    كأنّ الأنُوقَ الخُرْسَ فوقَ غُبارِهِ

    طَوالِعُ شَيبٍ في مَفَارِقِ أسوَدِ

    وليس قَضيبُ الهِندِ إلاّ كنابِتٍ

    من القَضْبِ في كفّ الهِدانِ المُعرِّدِ

    متى أنا في رَكْبٍ يؤمّونَ مَنْزِلاً

    تَوَحّدَ من شخْصِ الشريفِ بأوْحَدِ

    على شَدْقمِيّاتٍ كأنّ حُداتَها

    إذا عَرّسَ الرّكْبانُ شُرّابُ مُرقِدِ

    تُلاحِظُ أعلامَ الفَلا بنَواظِرٍ

    كُحِلْنَ من الليلِ التّمامِ بإثْمدِ

    وقد أذهبتْ أخفافَها الأرضُ والوَجَى

    دماً وتَرَدّى فِضّةً كلُّ مُزْبِدِ

    يُخَلْنَ سَماماً في السماءِ إذا بدَتْ

    لهنّ على أيْنٍ سَماوَةُ مُورِدِ

    تظُنّ به ذَوْبَ اللُّجَينِ فإنْ بدَتْ

    له الشمس أجرَتْ فوقَه ذَوْبَ عسجدِ

    تَبيتُ النّجومُ الزُّهرُ في حُجُراتهِ

    شوارعَ مثل اللّؤلُؤِ المُتَبَدِّدِ

    فأطْمَعْنَ في أشباحِهِنّ سواقِطاً

    على الماء حتى كِدْنَ يُلقَطْنَ باليَدِ

    فمَدّتْ إلى مثْلِ السّماءِ رقابَها

    وعَبّتْ قليلاً بينَ نَسْرٍ وفَرْقَدِ

    وذُكّرْنَ من نَيْلِ الشّريفِ مَوارِداً

    فما نِلْنَ منه غيرَ شِرْبٍ مُصَرَّدِ

    ولاحتْ لها نارٌ يُشَبّ وَقودُها

    لأضْيافِهِ في كلّ غَوْرٍ وفَدْفَدِ

    بخَرْقٍ يُطيلُ الجُنحُ فيه سُجودَه

    وللأرضِ زِيّ الراهِبِ المُتَعَبِّدِ

    ولو نَشَدَتْ نَعْشاً هناكَ بَناتُه

    لماتتْ ولم تَسْمَعْ لَه صَوْتَ مُنشِدِ

    وتكْتُمُ فيهِ العاصِفاتُ نُفُوسَها

    فلو عَصَفَتْ بالنّبْتِ لم يَتَأوّدِ

    ولم يَثْبُتِ القُطْبانِ فيهِ تحَيّراً

    وما تلكَ إلاّ وقْفَةٌ عنْ تَبَلّدِ

    فَمَرّتْ إذا غنّى الرّديفُ وقد وَنَتْ

    بذِكْراهُ زَفّتْ كالنّعامِ المُطَرَّدِ

    يُحاذِرْنَ وَطْءَ البِيدِ حتى كأنّما

    يَطَأنَ برأسِ الحَزْنِ هامةَ أصْيَدِ

    ويَنْفُرْنَ في الظّلْماءِ عن كلّ جدوَلٍ

    نِفَارَ جَبَانٍ عن حُسامٍ مُجَرَّدِ

    تَطَاوَلَ عهْدُ الوارِدينَ بمائِهِ

    وعُطّلَ حتى صارَ كالصّارم الصّدي

    إلى بَرَدَى حتى تظَلّ كأنّها

    وقد كَرَعَتْ فيه لَواثِمُ مِبْرَدِ

    أرى المجدَ سيفاً والقَريضَ نِجادَه

    ولولا نِجادُ السّيْفِ لم يُتَقَلّدِ

    وخيرُ حِمالاتِ السيوفِ حِمالَةٌ

    تَحَلّتْ بأبْكارِ الثّناءِ المُخَلَّدِ

    وأعْرَضَ مِن دونِ اللّقاءِ قَبائِلٌ

    يَعُلّونَ خِرْصانَ الوَشيجِ المُقَصَّدِ

    غُواةٌ إذا النّكباءُ حَفّتْ بيوتَهْم

    أقاموا لها الفُرْسانَ في كلّ مَرْصَدِ

    يُطيعونَ أمراً من غَوِيّ كأنّه

    على الدهرِ سُلطانٌ يجُورُ ويَعتدي

    إذا نَفَرَتْ من رَعْدِ غيثٍ سَوامُه

    سعَى نحْوَهُ بالمَشْرَفيّ المُهَنّدِ

    وقد علمَتْ هذي البسيطةُ أنّها

    تُراثُكَ فلْتَشْرُفْ بذاك وتزْدَدِ

    وإن شئتَ فازْعُمْ أنّ مَن فوقَ ظَهرِها

    عبيدُكَ واستَشْهِدْ إِلَهَكَ يَشْهَدِ

    وذِكْرُكَ يُذْكي الشوْق في كلّ خاطِرٍ

    ولو أنّه في قَلْبِ صَمّاء جَلْمَدِ''',
    'type': Type.general,
    'meter': Meter.tawil,
    'era': Era.abbasi,
  },
};